# IsLocked Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..IsLocked Property
FabricationConfigurationInfo Class See Also
---
Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsLocked { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsLocked As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsLocked {
	bool get ();
}
```

# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace